{
	"events": [
	  {
		"id": "gall",
		"name": "Entering Gall",
		"description": "The heavy gates of Gall groan aside, revealing a city built of stern grey stone and weathered timber. Worn cobbles pave streets that wind between tightly packed buildings, their upper stories often leaning close, casting long shadows. The air is sharp with the tang of coal smoke and the distant clang of a smithy, mingled with the everyday scents of a populous, if somewhat grim, settlement. Guards in practical, scuffed armor observe your passage with a practiced, neutral gaze. Gall is a place of pragmatism, not pleasantries.",
		"possibilities": [
		  {
			"id": "evt_gall_tavern_interior",
			"description": "Seek respite and potential allies at 'The Bent Mug' tavern."
		  },
		  {
			"id": "evt_gall_guildhall_entry",
			"description": "Look for paid work at the Mercenaries' Guild."
		  },
		  {
			"id": "leave",
			"description": "Leave the city's confines and return to the wilds."
		  }
		]
	  },
	  {
		"id": "evt_gall_tavern_interior",
		"name": "The Bent Mug",
		"description": "The air inside 'The Bent Mug' is thick with the aroma of stale ale, cheap stew, and damp wool. Low wooden beams hang overhead, scarred by years of careless tankards. A mix of dour locals and hard-bitten travelers occupy the rough-hewn tables, their conversations a low, rumbling murmur beneath the clatter of mugs and the occasional coarse laugh. A single, overworked server navigates the crowded floor.",
		"possibilities": [
		  {
			"id": "evt_tavern_find_potential_companion",
			"description": "Scan the patrons for a capable, if perhaps desperate, individual."
		  },
		  {
			"id": "gall",
			"description": "Decide the ale isn't worth the atmosphere and depart."
		  }
		]
	  },
	  {
		"id": "evt_tavern_find_potential_companion",
		"name": "A Keen Eye",
		"description": "Your gaze settles on a figure nursing a drink alone in a shadowed corner – [Name 0], a seasoned-looking [Class 0], judging by their worn gear. They meet your eye with a guarded, appraising look. Opportunity, or trouble?",
		"possibilities": [
		  {
			"id": "recruit_member",
			"description": "Offer 100 gold for their blade and loyalty.",
			"condition" : "gold_100"
		  },
		  {
			"id": "evt_gall_tavern_interior",
			"description": "Reconsider and return to observing the tavern's patrons.",
			"condition" : "gold_100"
		  },
		  {
			"id": "evt_gall_tavern_interior",
			"description": "Not having enough gold, you return to the tavern.",
			"condition" : "not(gold_100)"
		  }
		]
	  },
	  {
		"id": "evt_gall_guildhall_entry",
		"name": "Mercenaries' Guild Hall",
		"description": "The Guild Hall is a cavernous, echoing space built for function over comfort. The air smells faintly of old parchment, oiled leather, and nervous sweat. Rough-looking individuals study a large, crowded noticeboard plastered with contracts, while others wait on worn benches, sharpening blades or exchanging hushed words. A stern-faced clerk presides over a heavy oak counter, ready to deal in coin and contracts.",
		"possibilities": [
		  {
			"id": "evt_guild_noticeboard",
			"description": "Examine the noticeboard for available contracts."
		  },
		  {
			"id": "evt_guild_clerk_interaction",
			"description": "Report to the clerk about a completed task."
		  },
		  {
			"id": "gall",
			"description": "Leave the Guild Hall and return to the city streets."
		  }
		]
	  },
	  {
		"id": "evt_guild_noticeboard",
		"name": "The Contract Board",
		"description": "The noticeboard is a chaotic tapestry of handwritten pleas, official-looking bounties, and desperate missives, all vying for attention. Amidst the usual requests for rat extermination and debt collection, two particular postings stand out, promising greater risk and reward.",
		"possibilities": [
		  {
			"id": "opt_quest_accept_cauldron_easy",
			"description": "Take contract: 'Lost Spark in the Soot' (Cauldron Mountains).",
			"condition": "not(quest_001_accepted)"
		  },
		  {
			"id": "opt_quest_accept_hollow_hard",
			"description": "Take contract: 'Whispering Hollow Eradication' (Whispering Hollow).",
			"condition": "not(quest_002_accepted)"
		  },
		  {
			"id": "evt_gall_guildhall_entry",
			"description": "Step back from the board and return to the Guild Hall's main floor."
		  }
		]
	  },
	  {
		"id": "evt_guild_clerk_interaction",
		"name": "Reporting to the Guild Clerk",
		"description": "You approach the heavy oak counter. The Guild Clerk, a man with eyes that seem to have tallied countless grim bargains, looks up from his ledger, quill poised. 'Report?' he asks, his voice flat and devoid of warmth.",
		"possibilities": [
		  {
			"id": "opt_turn_in_quest_cauldron",
			"description": "Report completion of 'Lost Spark in the Soot'.\n Receive your reward (100 gold, 1500 XP).",
			"condition": "quest_001_accomplished"
		  },
		  {
			"id": "opt_turn_in_quest_hollow",
			"description": "Report completion of 'Whispering Hollow Eradication'.\n Receive your reward (200 gold, 4000 XP).",
			"condition": "quest_002_accomplished"
		  },
		  {
			"id": "evt_gall_guildhall_entry",
			"description": "State you have nothing to report at this time."
		  }
		]
	  }
	]
  }